{"keras_version": "2.0.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 32, "batch_input_shape": [null, 28, 28, 1], "activation": "elu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "elu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 128, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 10, "use_bias": true, "name": "dense_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "bias_constraint": null}}]}