{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_size": [3, 3], "name": "conv2d_1", "filters": 32, "bias_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_size": [3, 3], "name": "conv2d_2", "strides": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 10, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.3", "class_name": "Sequential"}